(ns amjil.core
  (:require [clj-http.client :as client]
            [clj-http.cookies :as cookie]
            [net.cgrand.enlive-html :as html]
            [clojure.data.json :as json]
            [clojure.tools.logging :as log])
  (:gen-class))

(def my-cookie (cookie/cookie-store))
(def forcast15-url "http://tianqi.moji.com/forecast15/china/inner-mongolia/")
(def weather-url "http://tianqi.moji.com/weather/china/inner-mongolia/")
(def hour24-url "http://tianqi.moji.com/index/getHour24")
(def area-url "http://tianqi.moji.com/weather/china/inner-mongolia")

(def condition {"晴" "ᠴᠡᠯᠮᠡᠭ" "多云" "ᠡᠭᠦᠯᠡᠲᠡᠢ" "少云" "ᠡᠭᠦᠯᠡᠷᠬᠡᠭ" "阴" "ᠪᠦᠷᠬᠦᠭ" "雨夹雪" "ᠪᠣᠷᠤᠭ᠎ᠠ ᠴᠠᠰᠤ" "小雨" "ᠪᠠᠭ᠎ᠠ ᠪᠣᠷᠤᠭ᠎ᠠ"})
(def address {"乌审召镇" "ᠦᠦᠰᠢᠨ ᠬᠣᠰᠢᠭᠤ" "乌达区" "ᠦᠬᠠᠶ" "鄂伦春自治旗" "ᠣᠷᠴᠣᠨ ᠬᠣᠰᠢᠭᠤ "
              "喀喇沁旗" "ᠬᠠᠷᠠᠴᠢᠨ ᠬᠣᠰᠢᠭᠤ" "巴彦淖尔市" "ᠪᠠᠶᠠᠨᠨᠠᠭᠤᠷ ᠬᠤᠳᠠ" "太仆寺旗" "ᠲᠠᠶᠢᠪᠤᠰᠧ ᠬᠣᠰᠢᠭᠤ"
              "中国达斡尔民族园" "ᠮᠤᠷᠢᠠᠳᠠᠪᠠᠭ᠎ᠠ" "伊克乌素镇" "ᠶᠡᠬᠡᠤᠰᠤ" "包头市青山区" "ᠪᠤᠭᠤᠲᠤ"
              "锡林郭勒盟" "ᠰᠢᠯᠢ ᠶᠢᠨ ᠭᠣᠸᠯ ᠬᠣᠲᠠ" "河南(内蒙)" "ᠾᠧᠨᠠᠨ" "凉城县" "ᠯᠢᠶᠠᠭᠩᠴᠧᠩ ᠰᠢᠶᠠᠨ"
              "巴彦诺尔贡" "ᠪᠠᠶᠠᠨᠨᠢᠷᠤᠭᠤᠨ" "磴口县" "‍ᠳᠧᠩᠺᠧᠤ ᠰᠢᠶᠠᠨ" "拐子湖" "ᠳᠤᠭᠤᠯᠠᠩ ᠨᠠᠭᠤᠷ"
              "四子王旗" "ᠲᠦᠷᠪᠡᠳ ᠬᠤᠰᠢᠭᠤ" "呼和浩特市新城区" "ᠰᠢᠨ᠎ᠠ ᠬᠤᠳᠡ ᠲᠤᠭᠤᠷᠢᠭ"
              "回民区" "ᠬᠤᠳᠤᠠ᠌ᠩ ᠡᠠᠷᠠᠤᠡ ‍ᠤᠡ ᠲᠤᠭᠤᠷᠢᠭ" "格根塔拉草原旅游中心" "ᠭᠡᠭᠡᠨᠳᠡᠯ᠎ᠡ ᠵᠢᠭᠤᠯᠴᠢᠯᠠᠯ ‍ᠤᠨ ᠤᠷᠤᠨ"
              "兴和县" "ᠰᠢᠩ ᠾᠧ ᠰᠢᠶᠠᠨ" "红山区" "ᠤᠯᠠᠭᠠᠨᠬᠠᠲᠠ" "临河区" "ᠯᠢᠨᠾᠧ"
              "岗子乡" "ᠭᠠᠩᠽᠢ ᠰᠢᠶᠠᠩ" "松山区" "ᠰᠦᠩᠱᠠᠨ ᠲᠣᠭᠣᠷᠢᠭ" "喀喇沁亲王府" "ᠬᠠᠷᠠᠴᠢᠨ ᠴᠢᠨ ᠸᠠᠩ ᠤᠨ ᠣᠷᠳᠣᠨ"
              "南海湿地景区" "ᠡᠮᠦᠨᠡᠲᠦ ᠲᠠᠩᠭᠢᠰ ᠤᠨ ᠦᠵᠡᠮᠵᠢ  ᠶᠢᠨ ᠣᠷᠣᠨ" "高力板镇" "ᠭᠣᠣᠯ ᠤᠨ ᠪᠠᠶᠢᠰᠢᠩ ᠪᠠᠯᠭᠠᠰᠤ "
              "科尔沁左翼中旗" "ᠬᠣᠷᠴᠢᠨ ᠵᠡᠭᠦᠨ ᠭᠠᠷᠤᠨ ᠳᠤᠮᠳᠠᠳᠤ ᠬᠣᠰᠢᠭᠤ "
              "满洲里市" "ᠮᠠᠨᠵᠤᠤᠷ ᠬᠤᠳᠠ" "昭君博物院" "ᠵᠤᠤ ᠵᠢᠶᠦ᠋ᠨ ᠲᠦᠮᠡᠨ ᠪᠣᠳᠠᠰ ᠤᠨ ᠬᠦᠷᠢᠶᠡᠯᠡᠩ"
              "奈曼旗" "ᠨᠠᠶᠮᠠᠨ ᠬᠣᠰᠢᠭᠤ" "集宁区" "ᠵᠢᠨᠢᠩ ᠲᠣᠭᠣᠷᠢᠭ" "巴林右旗" "ᠪᠠᠭᠠᠷᠢᠨ ᠪᠠᠷᠠᠭᠤᠨ ᠬᠣᠰᠢᠭᠤ"
              "鄂托克前旗" "ᠤᠳᠤᠭ ᠤᠨ ᠡᠮᠦᠨᠡᠲᠦ ᠬᠣᠰᠢᠭᠤ" "中国·克什克腾世界地质公园" "ᠬᠡᠰᠢᠭᠲᠡᠨ"
              "鄂温克族自治旗" "ᠡᠸᠡᠩᠬᠢ ᠬᠣᠰᠢᠭᠤ" "呼和诺尔旅游景区" "ᠬᠦᠬᠡ ᠨᠠᠭᠤᠷ ᠵᠢᠭᠤᠯᠴᠢᠯᠠᠯ ᠤᠨ ᠣᠷᠣᠨ"
              "浩尔吐乡" "ᠬᠣᠭᠣᠯᠠᠶᠢᠲᠤ ᠰᠢᠶᠠᠩ" "石拐区" "ᠰᠢᠭᠤᠢᠲᠤ ᠲᠣᠭᠣᠷᠢᠭ"
              "新巴尔虎右旗" "ᠰᠢᠨ᠎ᠡ ᠪᠠᠷᠭᠤ ᠪᠠᠷᠠᠭᠤᠨ ᠬᠣᠰᠢᠭᠤ" "土默特右旗" "ᠲᠦᠮᠡᠳ ᠪᠠᠷᠠᠭᠤᠨ ᠬᠣᠰᠢᠭᠤ"
              "锡林高勒镇（现吉兰泰镇）" "ᠵᠢᠷᠠᠨᠲᠠᠶ ᠪᠠᠯᠭᠠᠰᠤ" "头道湖" "ᠡᠮᠤᠨ᠎ᠠ ᠨᠠᠭᠤᠷ"
              "成吉思汗陵旅游区" "ᠴᠢᠩᠬᠢᠰ ‍ᠤᠨ ᠤᠩᠭᠤᠨ" "海南区" "ᠬᠠᠶᠢᠨᠠᠨ ᠲᠣᠭᠣᠷᠢᠭ"
              "阿拉善左旗" "ᠠᠯᠠᠱᠠ ᠵᠡᠭᠦᠨ ᠬᠣᠰᠢᠭᠤ" "霍林郭勒市" "ᠬᠣᠣᠯᠢᠨ ᠭᠣᠣᠯ ᠬᠤᠳᠠ"
              "阿尔山市" "ᠷᠠᠰᠢᠶᠠᠨ ᠬᠤᠳᠠ" "天义镇" "ᠲᠢᠶᠠᠨ ᠢ ᠪᠠᠯᠭᠠᠰᠤ" "通辽市" "ᠲᠦᠩᠯᠢᠶᠣᠤ ᠬᠤᠳᠠ"
              "察哈尔右翼中旗" "ᠴᠠᠬᠠᠷ ᠪᠠᠷᠠᠭᠤᠨ ᠭᠠᠷᠤᠨ ᠳᠤᠮᠳᠠᠳᠤ ᠬᠣᠰᠢᠭᠤ"
              "达尔罕茂明安联合旗" "ᠳᠠᠷᠬᠠᠨ ᠮᠤᠤᠮᠢᠩᠭᠠᠨ ᠬᠣᠯᠪᠣᠭᠠᠲᠤ ᠬᠣᠰᠢᠭᠤ"
              "岱海旅游中心" "ᠲᠠᠢᠭ᠎ᠠ  ᠢᠨ ᠨᠠᠭᠤᠷ ᠵᠤᠭᠠᠴᠠᠯ ᠤᠨ ᠲᠥᠪ"
              "牙克石市" "ᠶᠠᠭᠰᠢ ᠬᠤᠳᠠ" "呼和浩特市" "ᠬᠥᠬᠡᠬᠣᠲᠠ"
              "土默特左旗" "ᠲᠦᠮᠡᠳ ᠵᠡᠭᠦᠨ ᠬᠣᠰᠢᠭᠤ" "新世纪青年生态园" "ᠰᠢᠨ ᠵᠠᠭᠤᠨ ᠵᠠᠯᠠᠭᠤᠴᠤᠳ ‍ᠤᠨ ᠠᠮᠢ ᠠᠬᠣᠢ ᠶ᠋ᠢᠨ ᠬᠦᠷᠢᠶᠡᠯᠡᠩ"
              "鄂尔多斯市" "ᠤᠷᠳᠤᠰ ᠬᠤᠳᠠ" "东乌珠穆沁旗" "ᠵᠡᠭᠦᠨ ᠦᠵᠦᠮᠦᠴᠢᠨ ᠬᠣᠰᠢᠭᠤ"
              "海拉尔区" "ᠬᠠᠶᠢᠯᠠᠷ ᠲᠣᠭᠣᠷᠢᠭ" "新巴尔虎左旗" "ᠰᠢᠨ᠎ᠡ ᠪᠠᠷᠭᠤ ᠵᠡᠭᠦᠨ ᠬᠣᠰᠢᠭᠤ"
              "苏尼特右旗" "ᠰᠥᠨᠢᠳ ᠪᠠᠷᠠᠭᠤᠨ ᠬᠣᠰᠢᠭᠤ" "蒙牛工业旅游景区" "ᠮᠸᠩ ᠨᠢᠦ ᠠᠵᠤ ᠦᠢᠯᠡᠳᠪᠦᠷᠢ ᠶᠢᠨ ᠵᠤᠭᠠᠴᠠᠯ ᠤᠨ ᠣᠷᠣᠨ"
              "响沙湾" "ᠪᠦᠷᠢᠶ᠎ᠡ ᠮᠠᠩᠬ᠎ᠠ" "北方兵器城" "ᠤᠮᠠᠷᠠᠳᠤ ᠶ᠋ᠢᠨ ᠵᠡᠷ ᠵᠡᠪᠰᠡᠭ ᠬᠣᠳᠠ"
              "敖汉旗" "ᠠᠤᠬᠠᠨ ᠬᠣᠰᠢᠭᠤ" "海拉尔农业发展园区" "ᠬᠠᠶᠢᠯᠠᠷ ᠲᠠᠷᠢᠶᠠᠯᠠᠩ ᠤᠨ ᠦᠢᠯᠡᠰ ᠤᠨ ᠬᠦᠭᠵᠢᠯᠳᠡ ᠬᠦᠷᠢᠶᠡᠯᠡᠩ"
              "平庄镇" "ᠫᠢᠩᠵᠤᠸᠠᠩ ᠪᠠᠯᠭᠠᠰᠤ" "满都拉镇" "ᠮᠠᠨᠳᠤᠯ᠎ᠠ ᠪᠠᠯᠭᠠᠰᠤ" "科尔沁右翼前旗" "ᠬᠣᠷᠴᠢᠨ ᠪᠠᠷᠠᠭᠤᠨ ᠭᠠᠷᠤᠨ ᠡᠮᠦᠨᠡᠲᠦ ᠬᠣᠰᠢᠭᠤ"
              "东胜区" "ᠳ᠋ᠦᠩᠱᠧᠩ ᠲᠣᠭᠣᠷᠢᠭ" "乌审旗" "ᠦᠦᠰᠢᠨ ᠬᠣᠰᠢᠭᠤ" "杭锦后旗" "ᠬᠠᠩᠭᠢᠨ ᠬᠣᠶᠢᠲᠤ ᠬᠣᠰᠢᠭᠤ"
              "乌拉特后旗" "ᠤᠷᠠᠳ ᠤᠨ ᠬᠣᠶᠢᠲᠤ ᠬᠣᠰᠢᠭᠤ" "那仁宝力格" "ᠨᠠᠷᠠᠨᠪᠤᠯᠠᠭ"
              "朱日和镇" "ᠵᠢᠷᠦᠬᠡ ᠪᠠᠯᠭᠠᠰᠤ" "舍伯吐镇" "ᠱᠧᠪᠠᠷᠲᠦ ᠪᠠᠯᠭᠠᠰᠤ" "海拉尔国家森林公园" "ᠬᠠᠶᠢᠯᠠᠷ ᠂ ᠤᠯᠤᠰ ᠤᠨ ᠣᠶ ᠰᠢᠭᠤᠶ ᠶᠢᠨ ᠴᠡᠴᠡᠷᠯᠢᠭ"
              "正蓝旗" "ᠰᠢᠯᠤᠭᠤᠨ ᠬᠦᠬᠡ ᠬᠣᠰᠢᠭᠤ" "海勃湾区" "ᠬᠠᠢᠢᠷᠤᠪ ᠤᠨ ᠳᠤᠬᠤᠢ ᠲᠣᠭᠣᠷᠢᠭ"
              "孪井滩示范区" "ᠯᠤᠸᠠᠨ ᠵᠢᠩ ᠲᠠᠨ ᠵᠢᠱᠢᠶ᠎ᠠ ᠦᠵᠡᠬᠦᠯᠬᠦ ᠲᠣᠭᠣᠷᠢᠭ" "乌海市" "ᠦᠬᠠᠶ ᠬᠤᠳᠠ"
              "美岱召" "ᠮᠠᠶᠢᠳᠠᠷ ᠵᠤᠤ" "莫尔道嘎国家森林公园" "莫尔道嘎国家森林公园" "ᠮᠤᠷᠢᠳᠠᠭ᠎ᠠ ᠤᠯᠤᠰ ᠤᠨ ᠣᠶ ᠰᠢᠭᠤᠶ ᠶᠢᠨ ᠴᠡᠴᠡᠷᠯᠢᠭ"
              "希拉穆仁镇" "ᠰᠢᠷᠠᠮᠥ᠋ᠷᠡᠨ ᠪᠠᠯᠭᠠᠰᠤ" "扎鲁特旗" "ᠵᠠᠷᠤᠳ ᠬᠣᠰᠢᠭᠤ" "多伦县" "ᠲᠤᠯᠤᠡ ᠨᠠᠭᠤᠷ"
              "石门风景区" "ᠱᠢ ᠮᠧᠨ ᠦᠵᠡᠮᠵᠢ ᠶᠢᠨ ᠣᠷᠣᠨ" "吉兰泰镇" "ᠵᠢᠷᠠᠨᠲᠠᠶ ᠪᠠᠯᠭᠠᠰᠤ" "开鲁县" "ᠺᠠᠶᠢᠯᠦ ᠰᠢᠶᠠᠨ"
              "巴林左旗" "ᠪᠠᠭᠠᠷᠢᠨ ᠵᠡᠭᠦᠨ ᠬᠣᠰᠢᠭᠤ" "通辽大青沟国家级自然保护区" "ᠶᠠᠬᠡ ᠴᠦᠩᠬᠦᠯ ‍ᠤᠡ ᠭᠤᠤ"
              "正镶白旗" "ᠰᠢᠯᠤᠭᠤᠨ ᠬᠥᠪᠡᠭᠡᠲᠦ ᠴᠠᠭᠠᠨ ᠬᠣᠰᠢᠭᠤ" "林西县" "ᠯᠢᠨᠰᠢ ᠰᠢᠶᠠᠨ"
              "雅布赖镇" "ᠶᠠᠪᠠᠷᠠᠢ ᠪᠠᠯᠭᠠᠰᠤ" "察哈尔右翼前旗" "ᠴᠠᠬᠠᠷ ᠪᠠᠷᠠᠭᠤᠨ ᠭᠠᠷᠤᠨ ᠡᠮᠦᠨᠡᠲᠦ ᠬᠣᠰᠢᠭᠤ"
              "大佘太镇" "ᠰᠢᠭᠡᠳᠡᠢ ᠪᠠᠯᠭᠠᠰᠤ" "国门景区" "ᠤᠯᠤᠰ ᠤᠨ ᠡᠭᠦᠳᠡ  ᠦᠵᠡᠮᠵᠢ ᠶᠢᠨ ᠣᠷᠣᠨ"
              "苏尼特左旗" "ᠰᠥᠨᠢᠳ ᠵᠡᠭᠦᠨ ᠬᠣᠰᠢᠭᠤ" "八里罕镇" "ᠪᠤᠷᠬᠠᠨᠲᠤ ᠪᠠᠯᠭᠠᠰᠤ"
              "乌兰察布市" "ᠤᠯᠠᠭᠠᠨᠴᠠᠪ ᠬᠤᠳᠠ" "呼和浩特乌素图国家森林公园" "ᠤᠰᠤᠲᠤ ᠤᠯᠤᠰ ᠤᠨ ᠤᠢ ᠰᠢᠭᠤᠢ ᠶ᠋ᠢᠨ ᠴᠡᠴᠡᠷᠯᠢᠭ"
              "扎兰屯市" "ᠵᠠᠯᠠᠨ ᠠᠶᠢᠯ ᠬᠤᠳᠠ" "乌兰浩特市" "ᠤᠯᠠᠭᠠᠨᠬᠣᠲᠠ"
              "五当召" "ᠪᠠᠳᠺᠠᠷ ᠰᠦᠮ᠎ᠡ" "昆都仑区" "ᠬᠥᠨᠳᠡᠯᠡᠨ ᠲᠣᠭᠣᠷᠢᠭ"
              "乌拉特前旗" "ᠤᠷᠠᠳ ᠤᠨ ᠡᠮᠦᠨᠡᠲᠦ ᠬᠣᠰᠢᠭᠤ" "莫力达瓦达斡尔族自治旗" "ᠮᠤᠷᠢᠡᠲᠠᠪᠠᠭ᠎ᠠ"
              "东河区" "ᠳ᠋ᠦᠩ ᠾᠧ ᠲᠣᠭᠣᠷᠢᠭ" "呼市郊区" "ᠬᠥᠬᠡᠬᠣᠲᠠ ᠶᠢᠨ ᠲᠡᠭᠦᠷᠭᠡ"
              "根河市" "ᠭᠡᠭᠡᠨ ᠭᠣᠣᠯ ᠬᠤᠳᠠ" "丰镇市" "ᠹᠧᠩᠵᠧᠨ"
              "万豪蒙古大营" "ᠸᠠᠨ ᠬᠤᠤ ᠮᠣᠩᠭᠣᠯ ᠶᠡᠬᠡ ᠠᠶᠢᠯ" "九原区" "ᠵᠢᠤ ᠶᠤᠸᠠᠨ ᠲᠣᠭᠣᠷᠢᠭ"
              "突泉县" "ᠲᠦᠴᠢᠦᠸᠠᠨ ᠰᠢᠶᠠᠨ" "达拉特旗" "ᠳᠠᠯᠠᠳ ᠬᠣᠰᠢᠭᠤ"
              "胡尔勒镇" "ᠬᠦᠷᠡᠯ ᠪᠠᠯᠭᠠᠰᠤ" "乌拉特中旗" "ᠤᠷᠠᠳ ᠤᠨ ᠳᠤᠮᠳᠠᠳᠤ ᠬᠣᠰᠢᠭᠤ"
              "博克图镇" "ᠪᠤᠭᠤᠲᠤ ᠪᠠᠯᠭᠠᠰᠤ" "固阳县" "ᠭᠦᠶᠡᠩ ᠰᠢᠶᠠᠨ"
              "清水河县" "ᠴᠢᠩ ᠱᠦᠢ ᠾᠧ ᠰᠢᠶᠠᠨ" "索伦镇" "ᠰᠣᠯᠣᠨ ᠪᠠᠯᠭᠠᠰᠤ"
              "乌拉盖管理区" "ᠤᠯᠠᠭᠠᠶ ᠬᠠᠮᠢᠶᠠᠷᠤᠯᠲᠠ ᠶᠢᠨ ᠣᠷᠣᠨ"
              "陈巴尔虎旗" "ᠬᠠᠭᠤᠴᠢᠨ ᠪᠠᠷᠭᠤ ᠬᠣᠰᠢᠭᠤ" "科尔沁右翼中旗" "ᠬᠣᠷᠴᠢᠨ ᠪᠠᠷᠠᠭᠤᠨ ᠭᠠᠷᠤᠨ ᠳᠤᠮᠳᠠᠳᠤ ᠬᠣᠰᠢᠭᠤ"
              "呼伦贝尔市" "ᠬᠥᠯᠥᠨ ᠪᠤᠢᠢᠷ ᠬᠤᠳᠠ" "化德县" "ᠬᠤᠸᠠᠳᠧ ᠰᠢᠶᠠᠨ"
              "托克托县" "ᠲᠣᠭᠲᠠᠬᠤ ᠰᠢᠶᠠᠨ" "翁牛特旗" "ᠣᠩᠨᠢᠭᠤᠳ ᠬᠣᠰᠢᠭᠤ"
              "克什克腾旗" "ᠬᠡᠰᠢᠭᠲᠡᠨ ᠬᠣᠰᠢᠭᠤ" "扎赉特旗" "ᠵᠠᠯᠠᠶᠢᠳ ᠬᠣᠰᠢᠭᠤ"
              "西乌珠穆沁旗" "ᠪᠠᠷᠠᠭᠤᠨ ᠦᠵᠦᠮᠦᠴᠢᠨ ᠬᠣᠰᠢᠭᠤ" "阿拉善盟" "ᠠᠯᠠᠱᠠ ᠠᠶᠢᠮᠠᠭ"
              "宝国吐乡" "ᠪᠤᠭᠤᠲᠤ ᠰᠢᠶᠠᠩ" "梅力更自然生态风景区" "ᠮᠠᠷᠭᠡᠡ ᠪᠠᠶᠢᠭᠠᠯᠢ ᠶ᠋ᠢᠨ ᠠᠮᠢ ᠠᠬᠣᠢ ᠶ᠋ᠢᠨ ᠦᠵᠡᠮᠵᠢ ᠶ᠋ᠢᠨ ᠣᠷᠣᠨ"
              "扎赉诺尔区" "ᠵᠠᠯᠠᠶᠢᠨᠠᠭᠤᠷ" "阿尔山海神圣泉旅游度假区" "ᠳᠠᠯᠠᠶ ᠠᠷᠢᠭᠤᠨ ᠪᠤᠯᠠᠭ ᠤᠨ ᠷᠠᠰᠢᠶᠠᠨ ᠵᠢᠭᠤᠯᠴᠢᠯᠠᠯ ᠠᠮᠠᠷᠠᠯᠲᠠ ᠶᠢᠨ ᠣᠷᠣᠨ"
              "诺敏镇（小二沟）" "ᠨᠣᠮᠢᠨ ᠪᠠᠯᠭᠠᠰᠤ" "阿荣旗" "ᠠᠷᠤᠨ ᠬᠣᠰᠢᠭᠤ" "准格尔旗" "ᠵᠡᠭᠦᠨᠭᠠᠷ ᠬᠣᠰᠢᠭᠤ"
              "元宝山区" "ᠶᠤᠸᠠᠨ ᠪᠦᠦ ᠱᠠᠨ ᠲᠣᠭᠣᠷᠢᠭ" "青龙山镇" "ᠴᠢᠩ ᠯᠦᠩ ᠱᠠᠨ ᠪᠠᠯᠭᠠᠰᠤ"
              "和林格尔县" "ᠬᠣᠷᠢᠨᠭᠡᠷ ᠰᠢᠶᠠᠨ" "商都县" "ᠱᠠᠩᠳᠤ" "伊金霍洛旗" "ᠡᠵᠡᠨ ᠬᠣᠷᠣᠭ᠎ᠠ ᠬᠣᠰᠢᠭᠤ"
              "乌斯泰镇" "ᠤᠰᠤᠲᠠᠢ ᠪᠠᠯᠭᠠᠰᠣ" "玉泉区" "ᠢᠦᠢ ᠴᠢᠤᠸᠠᠨ ᠲᠣᠭᠣᠷᠢᠭ"
              "阿巴嘎旗" "ᠠᠪᠠᠭ᠎ᠠ ᠬᠣᠰᠢᠭᠤ" "成吉思汗庙" "ᠴᠢᠩᠭᠢᠰ ᠦᠨ ᠰᠦᠮ᠎ᠡ"
              "科尔沁区" "ᠬᠣᠷᠴᠢᠨ ᠲᠣᠭᠣᠷᠢᠭ" "贺兰山南寺旅游区" "ᠠᠯᠠᠱᠠ ᠠᠭᠤᠯᠠ ᠟ᠶ᠋ᠢᠨ ᠡᠮᠦᠨᠡᠲᠦ ᠰᠦᠮ᠎ᠡ ᠵᠤᠭᠠᠴᠠᠯ ᠤᠨ ᠣᠷᠣᠨ"
              "五原县" "ᠦᠶᠤᠸᠠᠨ ᠰᠢᠶᠠᠨ" "科尔沁左翼后旗" "ᠬᠣᠷᠴᠢᠨ ᠵᠡᠭᠦᠨ ᠭᠠᠷᠤᠨ ᠬᠣᠶᠢᠲᠤ ᠬᠣᠰᠢᠭᠤ"
              "二连浩特市" "ᠡᠷᠢᠶᠡᠨ ᠬᠤᠳᠠ" "察哈尔右翼后旗" "ᠴᠠᠬᠠᠷ ᠪᠠᠷᠠᠭᠤᠨ ᠭᠠᠷᠤᠨ ᠬᠣᠶᠢᠲᠤ ᠬᠣᠰᠢᠭᠤ"
              "额尔古纳市" "ᠡᠷᠭᠦᠨ᠎ᠡ ᠬᠤᠳᠠ" "中泉子" "ᠵᠦᠩ ᠴᠵᠤᠸᠠᠡ ᠽᠢ"
              "兴安盟" "ᠬᠢᠩᠭᠠᠨ ᠠᠶᠢᠮᠠᠭ" "杭锦旗" "ᠬᠠᠩᠭᠢᠨ ᠬᠣᠰᠢᠭᠤ" "包头市" "ᠪᠤᠭᠤᠲᠤ ᠬᠤᠳᠠ"
              "锡林浩特市" "ᠰᠢᠯᠢ ᠶᠢᠨ ᠬᠤᠳᠠ" "鄂托克旗" "ᠤᠳᠤᠭ ᠬᠣᠰᠢᠭᠤ" "额济纳旗" "ᠡᠵᠡᠨ᠎ᠡ ᠬᠣᠰᠢᠭᠤ"
              "赛罕区" "ᠰᠠᠶᠢᠬᠠᠨ ᠲᠣᠭᠣᠷᠢᠭ" "赤峰市" "ᠤᠯᠠᠭᠠᠨᠬᠠᠳᠠ ᠬᠤᠳᠠ" "图里河镇" "ᠳᠤᠯᠢ ᠭᠣᠣᠯ ᠪᠠᠯᠭᠠᠰᠤ"
              "镶黄旗" "ᠬᠥᠪᠡᠭᠡᠲᠦ ᠰᠢᠷ᠎ᠠ ᠬᠣᠰᠢᠭᠤ" "武川县" "ᠦᠴᠦᠸᠠᠨ ᠰᠢᠶᠠᠨ" "巴雅尔吐胡硕镇" "ᠪᠠᠶᠠᠷᠳᠤᠬᠤᠰᠢᠭᠤ ᠪᠠᠯᠭᠠᠰᠤ"
              "库伦旗" "ᠬᠦᠷᠢᠶ᠎ᠡ ᠬᠣᠰᠢᠭᠤ" "卓资县" "ᠵᠦᠸᠧᠽᠢ ᠰᠢᠶᠠᠨ" "乌兰夫同志纪念馆" "ᠤᠯᠠᠭᠠᠨᠬᠦᠦ ᠨᠥᠬᠥᠷ ᠦᠨ ᠳᠤᠷᠠᠰᠬᠠᠯ ᠤᠨ ᠣᠷᠳᠣᠨ"
              "吊桥公园" "ᠡᠯᠭᠦᠮᠡᠯ ᠬᠥᠭᠥᠷᠭᠡ ᠴᠡᠴᠡᠷᠯᠢᠭ" "海力素" "ᠬᠠᠶᠢᠯᠠᠰᠤ" "阿拉善右旗" "ᠠᠯᠠᠱᠠ ᠪᠠᠷᠠᠭᠤᠨ ᠬᠣᠰᠢᠭᠤ"
              "宁城县" "ᠨᠢᠩᠴᠧᠩ ᠰᠢᠶᠠᠨ" "白云鄂博矿区" "ᠪᠠᠶᠠᠡᠡᠣᠪᠤᠭ᠎ᠠ ᠠᠭᠤᠷᠬᠠᠶ ᠶᠢᠨ ᠲᠣᠭᠣᠷᠢᠭ"
              "哈素海" "ᠬᠠᠷ᠎ᠠ ᠤᠰᠤ ᠨᠠᠭᠤᠷ" "阿鲁科尔沁旗" "ᠠᠷᠤ ᠬᠣᠷᠴᠢᠨ ᠬᠣᠰᠢᠭᠤ"})


(defn area-urls []
  (let [areas (->> (-> (client/get area-url) :body (java.io.StringReader.) (html/html-resource)
                     (html/select [:div.city_hot :ul :li :a]))
                (map #(list (first (:content %)) (-> % :attrs :href)))
                (map #(into [] %))
                (into {}))]))

(defn forcast
  [area]
  (let [forcast15-url (str forcast15-url area)
        weather-url (str weather-url area)
        forcast (-> (client/get forcast15-url {:cookie-store my-cookie})
                  :body (java.io.StringReader.) (html/html-resource)
                  (html/select [:div#detail_future :div.detail_future_grid :div.wea_list :li])
                  (html/texts))
        forcast15 (->> forcast
                    (map #(clojure.string/split % #"\n"))
                    (map (fn [x] (map #(clojure.string/trim %) x)))
                    (map #(keep-indexed (fn [idx x] (if (contains? #{2 8 9 15 16} idx) x)) %))
                    (map #(zipmap [:from :high :low :to :date] %)))
        weather (->> (-> (client/get weather-url {:cookie-store my-cookie})
                       :body (java.io.StringReader.) (html/html-resource)
                       (html/select [:div.forecast :ul.days])
                       (html/texts))
                  (map #(clojure.string/split % #"\n"))
                  (map (fn [x] (map #(clojure.string/trim %) x)))
                  (map #(keep-indexed (fn [idx x] (if (contains? #{8 9 11 12 15} idx) x)) %)))

        hour24 (-> (client/get hour24-url {:cookie-store my-cookie}) :body json/read-str)
        sunset (-> hour24 (get "sunset") (select-keys ["date" "sunrise" "sundown"]))
        hour24 (->> (get hour24 "hour24")
                 (map #(into {} (map (fn [[k v]] [(subs k 1) v]) %))))]
    {:area area :forcast15 forcast15 :forcast3 weather :sunset sunset :hour24 hour24}))


(defn -main
  "I don't do a whole lot ... yet."
  [& args]
  (println "Hello, World!"))
